app/controllers/remedios_controller.rb

SELECT `remedios`.* FROM `remedios`
---
  def index
    @remedios = Remedio.all

SELECT `remedios`.* FROM `remedios` WHERE `remedios`.`id` = 3 LIMIT 1
---
  def show
    @remedio = Remedio.find(params[:id])

SELECT `remedios`.* FROM `remedios` WHERE `remedios`.`id` = 1 LIMIT 1
---
  def edit
    @remedio = Remedio.find(params[:id])

INSERT INTO `remedios` (`categoria_id`, `composicao`, `created_at`, `entrega`, `nome`, `preco`, `receita`, `updated_at`) VALUES (NULL, 'Whisky e Água de Coco.', '2013-02-18 13:02:04', '2013-02-06', 'Gardenal', 10, 'false', '2013-02-18 13:02:04')
---
  def create
    @remedio = Remedio.new(params[:remedio])

    respond_to do |format|
      if @remedio.save

SELECT `remedios`.* FROM `remedios` WHERE `remedios`.`id` = 1 LIMIT 1
UPDATE `remedios` SET `receita` = 'true', `updated_at` = '2013-02-15 18:09:16' WHERE `remedios`.`id` = 1
---
  def update
    @remedio = Remedio.find(params[:id])

    respond_to do |format|
      if @remedio.update_attributes(params[:remedio])

SELECT `remedios`.* FROM `remedios` WHERE `remedios`.`id` = 1 LIMIT 1
DELETE FROM `remedios` WHERE `remedios`.`id` = 1
---
  def destroy
    @remedio = Remedio.find(params[:id])
    @remedio.destroy